Revit 2024 API
BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup Property
 Modifications to the rebar set might cause it to revert to a uniform distribution. This can occur for layout changes as well as modifications to the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotKeepVariabilityOfRebarInGroup { get; }
Visual Basic
Public Shared ReadOnly Property CannotKeepVariabilityOfRebarInGroup As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotKeepVariabilityOfRebarInGroup {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace